package com.epam.khalii.ooptask.TaskGod;

/**
 * Created by Anhelina_Khalii on 24.04.2015.
 */
public class Main {
    public static void main(String[] args) {
        /**
         * Необходимо написать консольное приложение, в котором сначала нужно ввести значения свойств, для двух экземпляров людей (женщины и мужчины в произвольном порядке, возможны варианты ЖЖ, МЖ, ЖМ и ММ).
         Затем программа должна провести тест на совместимость и дать прогноз на результат отношений двух данных экземпляров. Алгоритм следующий:
         1. Метод “тест на совместимость” принимает два экземпляра людей и должен возвратить экземпляр человека или null.
         2. Вызвать метод “иметь отношения” первого экземпляра человека с аргументом - второй экземпляр.
         3. Полученный результат вернуть как результат работы метода “тест на совместимость”.

         */
    }
}
